<?php
function tour($text,$chat_id,$username)
{
    $user_id=$chat_id;
    $fifalaw="دقت کنید در صورت وجود هر اختلاف نظر نهایی با داور است"."\n"."🎮  قوانین مسابقات fifa

.  شرکت کننده باید از آوردن موبایل و وسایل ارتباطی به محوطه مسابقه خودداری کند (در هنگام مسابقه گوشی باید سایلنت باشد).

.  شرکت کننده گان باید راس تایم مقرر اعلام شده در محل مسابقه حاضر باشند در غیر اینصورت و تاخیر بیش از 10 دقیقه بازی ۳ بر ۰ به نفع حریف خواهد شد.

.  در پایان مسابقه شرکت کنندگان میبایست روی صندلی خود حضور داشته باشند تا داور نتیجه مسابقه را ثبت نماید.

.  بازیکنان در هر مسابقه تنها مجاز به ۳ بار توقف در هر بازی هستند که در این شرایط میبایست بازیکن صاحب توپ باشد و بازی در جریان نباشد.

.  بازیکنان مجاز به انتخاب تمام تیم ها (ملی و باشگاهی) هستند و تنها انتخاب تیمهای منتخب ممنوع میباشد.

.  انتخاب تیم های یکسان بلامانع هست.

.  انتخاب تیم میزبان قبل از آغاز بازی توسط داور با پرتاب سکه مشخص خواهد شد (اگر توافق نداشتید).

.  در مراحل گروهی هر برد ۳ ، مساوی ۱ و باخت ۰ امتیاز خواهد داشت.

.  رده بندی تیمها در مرحله گروهی بدین ترتیب خواهد بود: الف ) بیشترین امتیاز ، ب) بازی رو در رو ، ج) تفاضل گل

.  در صورت مساوی بودن تمام گزینه ها کمیته برگزاری موظف خواهد بود یک بازی تکراری بین طرفین برگزار کند ، که در صورت مساوی شدن آن بازی ، نتیجه در وقت های اضافی یا پنالتی مشخص خواهد شد.

.  سوییچ دروازبان ممنوع هست و سوییچ عمد همراه با سیو که در مصاف تک به تک اتفاق بیافتد گل محسوب خواهد شد و تکرار این عمل بلافاصله باعث حذف فرد خاطی خواهد شد.

.  در صورت استفاده از موارد ممنوع بازیکن از داور مسابقه اخطار دریافت خواهد کرد (هر دو اخطار = ۳-۰)

.  در صورت عدم توجه به قوانین و اصرار به کارهای این چنین بازیکن از مسابقات کنار گذاشته خواهد شد.

.  در صورت قطع بازی به دلیل نقص فنی با توجه به نتیجه بازی قطع شده ، یک بازی دیگر انجام میشود ، داور مسابقه مقدار باقی مانده زمان بازی قبل را اعلام خواهد کرد و به تعداد بازیکن های اخراجی یک تیم برای تیم مقابل در شروع بازی جدید گل در نظر خواهد گرفته شد.

.  بازی ناجوانمردانه عبارت خواهد بود از : استفاده از تنظیمات غیر قانونی ، صحبت های اضافه در طول برگزاری مسابقه ، باخت عمد به حریف ، انجام حرکات غیر حرفه ای در مقابل حریف ، گرفتن موقعیت بارز گل زنی با خطای عمد. (در این شرایط بازیکن اخطار خواهد گرفت که با دو اخطار بازی را واگذار خواهد کرد

ایجاد سر و صدا در هنگام از دست رفتن موقعیت یا خوشحالی همراه با سر و صدای زیاد بعد از به ثمر رسیدن گل هم باعث اخطار گرفتن خواهد شد (به شدت با دوستانی که در هنگام بازی از الفاظ ناشایست استفاده کنند برخورد خواهد شد)

 در آخر ذکر این مطلب هم خالی از لطف نیست برای دوستان : قوانین ذکر شده به هیچ عنوان قابل تغییر نیست 

 تنظیمات مسابقات فیفا ۱۸

Game Mode : Exhibition
Custom Formation : NOT Allowed
Man Marking : NOT Allowed
Custom Tactics : Allowed
Custom Corner And Free Kicks (Create Set Pieces) : Not Allowed
Half Lenghth : 6 Min
Difficulty Level : World Class
Game Speed : Normal
Camera : Tele broadcaste
Injuries : Off
Offsides : On
Bookings : On
Handball: Off
Radar : 2D
Time Of Game : Any
Weather : Dry
Controller Setting : Any
Crosses : Semi or Assisted
Power Pass Assistant : Off";
    $pesLaw="دقت کنید در صورت وجود هر اختلاف نظر نهایی با داور است"."\n"."قوانین PES 18
الف: شرايط شروع مسابقه
1.General Settings
Match Level: Super Star
Match Time: 10min
No. of Substitutions: 3
Player Emotions: off
Conditions: Normal
Injuries: off

2.Stadium
 
Stadium: Konami
Time:Night 
Season: summer
Weather: Fine
Length of grass: Normal
Pitch Conditions: Normal
 
 
3.Ball type: WE-PES 2017
 
 
4: Game Speed: 0
 
 
5:Camera Type: Wide (توافقى)
  
 
ب: شرايط انجام بازى
 
١. هرگونه استفاده از الفاظ نادرست و درگيرى با حريف و يا داوران مسابقات و    یا تبانی در مسابقات و نیز در صورت دریافت دو وارنینگ در مسابقه ،به منزله باخت و حذف از تورنومنت ميباشد.
 
٢. اتلاف وقت تنها فقط با نظر مستقیم داور اعمال می شود.
 
٣. تکل از پشت در موقعیت تک به تک وارنینگ دارد.
 
 
4.استفاده از هدست آزاد ميباشد.
 
5. در صورت قطع بازى در شرايط غير عمد، ادامه بازى در  بازى مجدد با احتساب ۱۰ دقيقه وقت +زمان باقى مانده از بازى برگزار خواهد شد، به ازای هر بازیکن اخراجی در بازی مجدد یک گل برای حریف حساب خواهد شد. اگر بازی تا دقیقه ۱۰ متوقف شود بازی از ابتدا برگزار خواهد شد.
 
6.در هر بازی رفت و برگشت بازیکنان مجاز به استفاده از یک تیم در دو بازی می باشند.


موارد کلی:
.

2.در صورت امکان تعدادی دسته  برای بازیکنانی که امکان فراهم کردن دسته را نداشتن فراهم شده که با تحویل گرفتن کارت ملی و ودیعه در اختیار آنها قرار گذاشته می شود.
 

3.به همراه داشتن کارت ملی و یا کارت اعتباری معتبر در مکان مسابقات برای شناسایی بازیکنان الزامیست.

4.بازیکنان باید حداقل 10 دقیقه قبل از شروع بازی در مکان مسابقات حضور داشته باشند و زمان مجاز برای تاخیر بازیکنان ۱۰ دقیقه است.

5.حضور هر بازیکن در چند کنسول مختلف مشکلی نخواهد داشت ولی مشکل تداخل زمان بازیها متوجه برگزار کنندگان نخواهد بود(در صورت امکان سعی خواهد شد در این مورد با بازیکنان همکاری شود)";


 if($text == 'ثبت نام در مسابقات 🏆' ){
     $db = Db::getInstance();
     $member_t = $db->query("SELECT * FROM tour WHERE user_id=:user_id", array(
         'user_id' => $user_id,
     ));

     if(count($member_t)== 1){

     }
     else{
         $db = Db::getInstance();
         $db->query("INSERT INTO tour (user_id) VALUES ('".$user_id."')");

     }

    MessageRequestJson("sendphoto", array('chat_id' =>$chat_id,'photo'=>"https://mehrdadseyfi.ir/punisherbot/gs.jpg",'caption'=>"مایل اید در کدام مسابقات شرکت کنید؟",'reply_markup' => array(resize_keyboard =>true,

        "keyboard"=>array(

            array('مسابقات فصلی 🌏','مسابقات هفتگی🥇'),
            array('منو اصلی')

        )

    )));

}elseif ($text == 'مسابقات هفتگی🥇'){
     $pes=1;
     $db = Db::getInstance();
     $db->modify("UPDATE tour SET week=:week WHERE user_id=:user_id", array(
         'week' => 1,
         'user_id' => $user_id,
     ));
     MessageRequestJson("sendphoto", array('chat_id' =>$chat_id,'photo'=>"https://mehrdadseyfi.ir/punisherbot/pesfifa.jpg",'caption'=>"بازی را انتخاب کنید"."\n"."هزینه شرکت در مسابقات هفتگی  20 هزار تومن هست"."\n"."جوایز این مسابقات:"."\n"."🥇نفر اول 150 هزار تومن
🥈نفر دوم 50 هزار تومن
🥉 نفر سوم 5 ساعت رایگان
🎖تمامی افراد شرکت کننده  1 ساعت رایگان",'reply_markup' => array(resize_keyboard =>true,

         "keyboard"=>array(

             array('FIFA 18','PES 18'),
             array('منو اصلی')

         )

     )));
 }elseif ($text == 'مسابقات فصلی 🌏'){
     $pes=1;
     $db = Db::getInstance();
     $db->modify("UPDATE tour SET season=:season WHERE user_id=:user_id", array(
         'season' => 1,
         'user_id' => $user_id,
     ));
     MessageRequestJson("sendphoto", array('chat_id' =>$chat_id,'photo'=>"https://mehrdadseyfi.ir/punisherbot/pesfifa.jpg",'caption'=>"مایل اید در کدام مسابقات شرکت کنید؟",'reply_markup' => array(resize_keyboard =>true,

         "keyboard"=>array(

             array('FIFA 18','PES 18'),
             array('منو اصلی')

         )

     )));
 }
else if($text == 'PES 18' ){


    MessageRequestJson("sendMessage", array('chat_id' =>$chat_id,'text'=>"قوانین را با دقت مطالعه و در پایان موافقت نمایید"."\n"."هزینه ثبت نام در مسابقات تا ساعت 24 چهارشنبه هر هفته 20 هزار
و درصورت ثبت نام خارج از زمان تعیین شده 25 هزار تومان می باشد 
خارج از زمان تعیین شده یعنی ثبت نام در بازه زمانی پنجشنبه و جمعه تا قبل از برگذاری قرعه کشی (معمولا قرعه کشی ساعت 14 برگزار می شود)"."\n".$pesLaw,'reply_markup' => array(resize_keyboard =>true,

        "keyboard"=>array(

            array('با قوانین pes موافقم'),
            array('منو اصلی')

        )

    )));

}else if($text == 'FIFA 18' ){


    MessageRequestJson("sendMessage", array('chat_id' =>$chat_id,'text'=>"قوانین را با دقت مطالعه و در پایان موافقت نمایید"."\n"."هزینه ثبت نام در مسابقات تا ساعت 24 چهارشنبه هر هفته 20 هزار
و درصورت ثبت نام خارج از زمان تعیین شده 25 هزار تومان می باشد 
خارج از زمان تعیین شده یعنی ثبت نام در بازه زمانی پنجشنبه و جمعه تا قبل از برگذاری قرعه کشی (معمولا قرعه کشی ساعت 14 برگزار می شود)"."\n".$fifalaw,'reply_markup' => array(resize_keyboard =>true,

        "keyboard"=>array(

            array('با قوانین فیفا موافقم'),
            array('منو اصلی')

        )

    )));

}else if($text == 'با قوانین pes موافقم' ){
    $pes=1;
    $db = Db::getInstance();
    $db->modify("UPDATE tour SET pes=:pes WHERE user_id=:user_id", array(
        'pes' => 1,
        'user_id' => $user_id,
    ));
    MessageRequestJson("sendMessage", array('chat_id' =>$chat_id,'text'=>"شما با موفقیت ثبت نام شده اید"."\n"."🔴🔵🔴🔵 توجه بفرمایید که ثبت نام شما زمانی قطعی می شود که وجه ورودی را پرداخت نمایید"."\n"."#آدرس
شهر زیبا _ بلوار تعاون _ آلاله شرقی _ انتهای عدالت _ هفتم غربی",'reply_markup' => array(resize_keyboard =>true,

        "keyboard"=>array(

            array('پرداخت مبلغ ورودی'),
            array('منو اصلی')

        )

    )));

}else if($text == 'با قوانین فیفا موافقم' ){
    $fifa=1;
    $db = Db::getInstance();
    $db->modify("UPDATE tour SET fifa=:fifa WHERE user_id=:user_id", array(
        'fifa' => 1,
        'user_id' => $user_id,
    ));
    MessageRequestJson("sendMessage", array('chat_id' =>$chat_id,'text'=>"شما با موفقیت ثبت نام شده اید"."\n"."🔴🔵🔴🔵 توجه بفرمایید که ثبت نام شما زمانی قطعی می شود که وجه ورودی را پرداخت نمایید"."\n"."#آدرس
شهر زیبا _ بلوار تعاون _ آلاله شرقی _ انتهای عدالت _ هفتم غربی",'reply_markup' => array(resize_keyboard =>true,

        "keyboard"=>array(


            array('پرداخت مبلغ ورودی'),
            array('منو اصلی')

        )

    )));

}else if($text == 'پرداخت مبلغ ورودی'){

    $pay=20000;
    MessageRequestJson("sendMessage", array('chat_id' =>"$chat_id",'text'=>"  لطفا با اتصال به درگاه فرآینده ثبت نام  خود را کامل کنید"."\n"."شما حتی می توانید مبلغ ورودی را کارت به کارت و یا در محل کلوب به ادمین به صورت حضوری پرداخت نمایید"."\n"."دقت نمایید در صورت پرداخت غیر از درگاه (کارت به کارت و یا حضوری ) حتما به ادمین اطلاع دهید تا ثبت نام شما را قطعی نماید"."\n"."شماره کارت"."\n"."5892-1011-7758-7454"."\n"."به نام حسن محمد شریفی زمانی"."\n"."@mehrdadsy", 'reply_markup' => array(

        "inline_keyboard"=>array(
            array(array("text"=>"اتصال به درگاه","url"=>"http://mehrdadseyfi.ir/pay/payment.php?user=$user_id&Des=ثبت نام در مسابقات پانیشر گیم کلاب&pay=$pay")),

        )

    )));
}
}
?>